kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
#include <Arduino.h>
#include <ModbusMaster.h>
#include <Preferences.h>
#include "esp_task_wdt.h"   // hardware watchdog (auto-reboot bila loop hang)
#include "esp_system.h"     // Phase 3 hardening: esp_reset_reason()
#include "spklu_types.h"

// ===========================================================
//                CONFIG (EDIT THIS SECTION)
// ===========================================================
// XY12550S registers
static const uint16_t REG_LOCK = 0x000F;   // 0=unlock, 1=lock
static const uint16_t REG_DEVICE = 0x001E; // device enable/status (R/W)
static const uint16_t REG_BLED = 0x0014;   // backlight brightness
static const uint16_t REG_SLEEP = 0x0015;  // rest screen time (minutes)
static const uint16_t XY_BLED_WAKE = 100;
static const uint16_t XY_BLED_SLEEP = 0;
static const uint16_t XY_SLEEP_MINUTES = 1;


//PIN
static String panelPin = "1234"; // default kalau belum ada di NVS

// Warna default (tidak aktif)
static const uint16_t MOTOR_INACTIVE_BCO = 0xFFFF; // background
static const uint16_t MOTOR_INACTIVE_PCO = 0x1A13; // teks putih (biar kebaca)

// Warna aktif (yang dipilih)
static const uint16_t MOTOR_ACTIVE_BCO   = 0x03DF; // background 0x03DF
static const uint16_t MOTOR_ACTIVE_PCO   = 0xFFFF; // teks putih

// Nextion UART
static const uint32_t NEXTION_BAUD = 115200;
static const int UART_NEXTION_RX = 16;
static const int UART_NEXTION_TX = 17;

// RS485 Modbus UART
static const uint32_t MODBUS_BAUD  = 56000;  // already configured on XY12550S
static const int UART_MODBUS_RX = 26;
static const int UART_MODBUS_TX = 27;

// Pricing
static const float PRICE_PER_KWH = 2440.0f;

// ===========================================================
//        BACKEND / PAYMENT INTEGRATION (Phase 2)
//  Antarmuka transport-agnostic lewat Serial (UART0/USB). Bisa dijembatani
//  oleh gateway server, modul WiFi/4G, atau Raspberry Pi yang terhubung ke
//  website payment. TIDAK mengganggu HMI Nextion (di Serial2 terpisah).
//
//  ENABLE_BACKEND        : aktifkan parser perintah + telemetri di UART0.
//  BACKEND_TELEMETRY_MS  : interval push #STATE (telemetri) ke backend.
//
//  MODE OPERASI (runtime, disimpan ke NVS):
//    OFFLINE (requireAuth=false) : tombol HMI bebas dipakai tanpa payment.
//                                  Cocok untuk uji coba atau mode mandiri.
//    ONLINE  (requireAuth=true)  : tombol HMI diblokir sampai $AUTH diterima.
//                                  Cocok untuk operasi berbayar penuh.
//  Toggle via: $SETONLINE / $SETOFFLINE dari backend, atau tombol ADM di HMI.
//  Status ditampilkan di HMI: "FREE MODE" vs "PAYMENT MODE".
// ===========================================================
static const bool     ENABLE_BACKEND       = true;
static const uint32_t BACKEND_TELEMETRY_MS  = 2000;

// Runtime mode flag — disimpan ke NVS key "req_auth"
// false = OFFLINE/FREE, true = ONLINE/PAYMENT
static bool requireAuth = false;

// Slave IDs for 3 channels
// NOTE: set to 0 to disable a channel in firmware.
static const uint8_t SLAVE_ID[3] = {1, 2, 3};
static inline bool chEnabled(uint8_t c){ return (c < 3) && (SLAVE_ID[c] != 0); }

// Start stop Timing
static uint32_t runMsAccum[3]  = {0,0,0};
static uint32_t runStartMs[3]  = {0,0,0};
static bool     runRunning[3]  = {false,false,false};
static bool     sessArmed[3]   = {false,false,false};

// State deteksi kabel dicabut
static uint8_t  cabutCount[3]   = {0, 0, 0};  // counter sample berturut-turut
static uint32_t cabutArmedMs[3] = {0, 0, 0};  // millis() batas mulai deteksi aktif

// Phase 3 hardening: rate-limit alarm suhu dini per channel
static uint32_t otWarnMs[3]     = {0, 0, 0};

// State debounce pushbutton emergency stop
static bool     btnLastRaw[3]      = {HIGH, HIGH, HIGH};
static bool     btnStable[3]       = {HIGH, HIGH, HIGH};
static uint32_t btnLastChangeMs[3] = {0, 0, 0};


// Timing
static const uint32_t POLL_INTERVAL_MS = 120;  // poll 1 channel every tick (RR)
static const uint32_t UI_INTERVAL_MS   = 250;

// Fault threshold
static const uint8_t MODBUS_FAIL_LIMIT = 5;

// Jumlah percobaan baca per poll sebelum dihitung gagal (tahan glitch RS485).
static const uint8_t MODBUS_READ_ATTEMPTS = 2;

// ===========================================================
//                 HARDWARE WATCHDOG (WDT)
//  Auto-reboot bila loop() macet > WDT_TIMEOUT_S detik. Penting untuk
//  stasiun tanpa operator. Operasi blocking terpanjang (PANELALL ~1s)
//  jauh di bawah timeout ini, jadi tidak akan reboot saat normal.
// ===========================================================
static const bool     ENABLE_TASK_WDT = true;
static const uint32_t WDT_TIMEOUT_S    = 12;

// ===========================================================
//          WATCHDOG EKSTERNAL (Phase 3 hardening)
//  Toggle pin ini tiap loop() untuk "menendang" IC WDT eksternal
//  (mis. TPS3813 / MAX6369) — sabuk-pengaman di atas WDT internal,
//  berguna bila WDT internal pun bermasalah. Set -1 untuk menonaktifkan.
// ===========================================================
static const int      EXT_WDT_PIN     = -1;   // contoh: GPIO4. -1 = nonaktif

// ===========================================================
//        ALARM SUHU DINI / SOFT OVER-TEMP (Phase 3 hardening)
//  Peringatan lebih awal di bawah OTP hardware XY-12550S. TIDAK
//  menggantikan OTP modul (itu tetap pengaman utama di hardware).
//   - t_in/t_ex >= OTP_WARN_C  -> tampilkan peringatan + emit event (rate-limited)
//   - OTP_SOFT_STOP true & suhu >= OTP_STOP_C -> hentikan output lebih dini
// ===========================================================
static const bool     OTP_SOFT_ENABLE = true;
static const float    OTP_WARN_C       = 70.0f;
static const bool     OTP_SOFT_STOP    = false;  // default: hanya warning
static const float    OTP_STOP_C       = 80.0f;
static const uint32_t OTP_WARN_INTERVAL_MS = 30000;

// ===========================================================
//            OCP AUTO-RECOVERY (Phase 1)
//  - Automatic retry setiap OCP_RETRY_INTERVAL_MS (2-3 detik)
//  - Max OCP_MAX_RETRIES (misal 5x) sebelum manual CLEAR
//  - Saat retry berhasil (output ON lagi), kembali ke CHARGING
//  - Saat exceed max retries, masuk OCP_FAULT (tunggu CLEAR manual)
// ===========================================================
static const uint32_t OCP_RETRY_INTERVAL_MS = 2500;  // 2.5 detik retry interval
static const uint8_t  OCP_MAX_RETRIES = 5;           // max 5 attempts


// Verify tolerances
static const float TOL_V   = 0.03f;   // 30mV
static const float TOL_A   = 0.03f;   // 30mA
static const float TOL_LVP = 0.08f;   // 80mV

// "Software CLF": always force output OFF before switching dataset / writing group.
static const bool SW_CLF_FORCE_OFF_BEFORE_SWITCH = true;
static const uint16_t SW_CLF_DELAY_MS = 20;

