kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
// ===========================================================
//          DETEKSI KABEL DICABUT (Cable Pull Detection)
//
//  Aktif hanya setelah charging berjalan >= CABUT_ARM_DELAY_MS.
//  Jika Iout tiba-tiba < CABUT_IOUT_THRESHOLD_A selama
//  CABUT_CONFIRM_SAMPLES sample berturut-turut => output OFF.
//
//  CABUT_IOUT_THRESHOLD_A : batas arus "beban hilang"
//  CABUT_CONFIRM_SAMPLES  : jumlah sample berturut-turut
//                           (120ms x 2 = 240ms konfirmasi)
//  CABUT_ISET_MIN_A       : deteksi aktif hanya jika iset >= ini
//                           (hindari false-trigger di CV tail)
//  CABUT_ARM_DELAY_MS     : grace period setelah START sebelum
//                           deteksi aktif (beri waktu arus naik)
// ===========================================================
static const float    CABUT_IOUT_THRESHOLD_A = 0.50f;
static const uint8_t  CABUT_CONFIRM_SAMPLES  = 2;
static const float    CABUT_ISET_MIN_A       = 4.0f;
static const uint32_t CABUT_ARM_DELAY_MS     = 5000; // 5 detik

// ===========================================================
//            PUSHBUTTON EXTERNAL EMERGENCY STOP
//  - 1 pushbutton per channel, fungsi: STOP saja.
//  - Tekan kapanpun saat CHARGING => STOP (identik tombol STOP di HMI).
//  - Jika tidak sedang CHARGING, tekanan diabaikan.
//  - Wiring: pushbutton antara GPIO dan GND, pakai INPUT_PULLUP.
//      C  -> GPIO
//      NO -> GND
//      NC -> tidak dipakai
//  - Debounce software 50ms, deteksi FALLING edge (tekan = LOW).
//  - Set pin ke -1 untuk menonaktifkan channel tertentu.
// ===========================================================
static const int      BTN_PIN[3]      = {32, 33, 25}; // GPIO CH1, CH2, CH3
static const uint32_t BTN_DEBOUNCE_MS = 50;

// ===========================================================
//                     SERIALS / MODBUS
// ===========================================================
HardwareSerial SerialModbus(1);
HardwareSerial SerialNextion(2);

ModbusMaster nodes[3];
Preferences prefs;

Channel ch[3];
MotorProfile profiles[3][10];

volatile uint8_t activePage = 0;

// W4 FIX: helper atomic read untuk activePage.
// Di ESP32 single-core Arduino, uint8_t read sudah atomic secara hardware,
// tapi fungsi ini mendokumentasikan intent dan memudahkan upgrade ke dual-core/FreeRTOS.
static inline uint8_t getActivePage() {
  return activePage; // uint8_t read pada ESP32 bersifat atomic
}

// Per-channel transient message (shown on g_sum on channel pages)
static String chanMsgText[3];
static uint16_t chanMsgColor[3] = {0xAD97,0xAD97,0xAD97};
static uint32_t chanMsgUntil[3] = {0,0,0};

// B2 FIX: cek expired dengan subtraksi unsigned, tahan millis() overflow 49-hari.
// BUGFIX (Rev8.3): logika sebelumnya TERBALIK -> pesan tidak tampil saat masih
// aktif, lalu menempel selamanya setelah lewat. Sekarang dipakai casting signed
// yang ringkas dan benar: expired bila (now - until) >= 0.
//   - Belum expired: millis() < until  -> selisih unsigned besar (>=0x80000000)
//                    -> (int32_t) bernilai negatif -> return false.
//   - Sudah expired: millis() >= until -> selisih kecil positif
//                    -> (int32_t) >= 0 -> return true.
static inline bool chanMsgExpired(uint8_t c) {
  return (int32_t)(millis() - chanMsgUntil[c]) >= 0;
}
 // from Nextion sendme (0=monitor, 1..3=channel pages, others=setting pages etc.)

// ===========================================================
//                        LOW LEVEL
// ===========================================================

// =====================  SKALA REGISTER XY12550S  =====================
// Sumber kebenaran tunggal untuk konversi <-> register (baca & tulis pakai
// konstanta yang SAMA supaya selalu konsisten).
//
//  - Voltage : 0.01V/LSB (datasheet radix 2)  -> SCALE 100   [cocok datasheet]
//  - Temp    : 0.1 C/LSB (datasheet radix 1)  -> /10
//  - OPP/S-OPP: 0.1W/LSB (datasheet radix 1)  -> *10
//
//  >>> PERINGATAN ARUS (WAJIB VERIFIKASI HARDWARE) <<<
//  Datasheet XY-12550S menyatakan I-SET/IOUT/S-OCP = radix 3 (0.001A/LSB, x1000),
//  contoh: 1.500A => 1500. Namun kode asli memakai x100 dengan catatan penulis
//  "confirmed: 15.00A => 1500" pada unit nyata. Kedua sisi (tulis & baca) di
//  firmware ini konsisten x100, sehingga nilai yang ditampilkan = nilai yang
//  di-set. Billing TIDAK terpengaruh (billing pakai register energi mWh).
//
//  JANGAN mengubah XY_A_SCALE ke 1000 tanpa mengukur arus nyata dengan clamp meter:
//   - x100 padahal hardware x1000  -> charger under-current (aman, hanya lambat).
//   - x1000 padahal hardware x100  -> charger OVER-CURRENT 10x (BAHAYA).
//  Default dipertahankan x100 (pilihan aman). Verifikasi, baru naikkan bila perlu.
static const float XY_V_SCALE = 100.0f;  // V  -> register
static const float XY_A_SCALE = 100.0f;  // A  -> register  (lihat peringatan di atas)
static const float XY_OPP_SCALE = 10.0f; // OPP 0.1W -> register (dipakai tulis & verify)

static inline uint16_t clampU16(int32_t x){ if(x<0) return 0; if(x>65535) return 65535; return (uint16_t)x; }
static inline uint16_t regV100(float v)  { return clampU16((int32_t)lroundf(v * XY_V_SCALE)); }
static inline uint16_t regA100(float a)  { return clampU16((int32_t)lroundf(a * XY_A_SCALE)); }

//Helper PIN
static bool isValidPin(const String& s){
  int n = s.length();
  if (n < 4 || n > 8) return false;
  for(int i=0;i<n;i++){
    if (!isDigit((unsigned char)s[i])) return false;
  }
  return true;
}

static void loadPanelPin(){
  // B3 FIX: pastikan namespace "spklu" aktif sebelum membaca PIN
  // loadProfilesFromNVSOrDefault() sudah memanggil prefs.begin("spklu"),
  // tapi loadPanelPin() dipanggil setelahnya jadi namespace sudah aktif.
  // Guard ini melindungi jika loadPanelPin() pernah dipanggil di konteks lain.
  panelPin = prefs.getString("panel_pin", "1234");
  if (!isValidPin(panelPin)) panelPin = "1234";
}

static void savePanelPin(const String& newPin){
  // Namespace "spklu" sudah dibuka sekali di loadProfilesFromNVSOrDefault()
  // (dipanggil di setup) dan tetap terbuka selama runtime. Memanggil
  // prefs.begin() berulang tidak diperlukan; cukup tulis nilainya.
  if (!isValidPin(newPin)) return;   // tolak PIN tidak valid
  panelPin = newPin;
  prefs.putString("panel_pin", panelPin);
}

// void rs485TxOn(){ digitalWrite(RS485_DE_RE, HIGH); }
// void rs485TxOff(){ digitalWrite(RS485_DE_RE, LOW); }
//void preTransmission(){ rs485TxOn(); }
//void postTransmission(){
  // Guard time (optional) – uncomment if you see sporadic timeouts/CRC issues.
  // SerialModbus.flush();
  // delayMicroseconds(200);
//   rs485TxOff();


