kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
// ===========================================================
//                      NEXTION HELPERS
// ===========================================================
void nxSendCmd(const String &cmd) {
  SerialNextion.print(cmd);
  SerialNextion.write(0xFF);
  SerialNextion.write(0xFF);
  SerialNextion.write(0xFF);
}

// Optional UI components (if you created them)
void uiMsg(const String& s, uint16_t color=0xAD97) {
  // if t_msg doesn't exist, Nextion will ignore (bkcmd=0 recommended)
  nxSendCmd("t_msg.txt=\"" + s + "\"");
  nxSendCmd("t_msg.pco=" + String(color));
}

// Show a short message on the active channel page (uses g_sum).
// This helps debugging interlocks like "STOP dulu" when user presses motor buttons.
void setChanMsg(uint8_t c, const String& s, uint16_t color=0xFCA0, uint32_t durMs=2500) {
  if (c >= 3) return;
  chanMsgText[c] = s;
  chanMsgColor[c] = color;
  chanMsgUntil[c] = millis() + durMs;
  if (activePage == (uint8_t)(c+1)) {
    nxSendCmd("g_sum.txt=\"" + s + "\"");
    nxSendCmd("g_sum.pco=" + String(color));
  }
}


// ===========================================================
//                 NEXTION INPUT PARSER (ROBUST)
//  - Handles Nextion return frames terminated by FF FF FF
//    (sendme 0x66, touch 0x65, ack 0x01/0x00, startup 0x00..)
//  - Handles ASCII commands ended with '\n'
// ===========================================================
struct NxParser {
  // ASCII command buffer
  String lineBuf;

  // Binary frame buffer (Nextion return data)
  bool inFrame = false;
  uint8_t fBuf[32];
  uint8_t fLen = 0;
  uint8_t ffCount = 0;

  void resetFrame(){ inFrame=false; fLen=0; ffCount=0; }

  void handleFrame() {
    if (fLen < 4) return; // minimal: <type> FF FF FF
    uint8_t type = fBuf[0];

    // strip last 3 FFs logically
    uint8_t payloadLen = (fLen >= 3) ? (uint8_t)(fLen - 3) : 0;

    // 0x66: sendme – current page
    if (type == 0x66 && payloadLen >= 2) {
      activePage = fBuf[1];
      return;
    }

    // 0x65: touch event (ignored here)
    // 0x00..0x1F: status/ack/error codes (ignored)
    // 0x70/0x71: get return string/number (ignored for now)
    (void)type;
  }

  bool hasLine(String &out) {
    out = "";

    while (SerialNextion.available()) {
      uint8_t b = SerialNextion.read();

      // If we're in a binary frame, accumulate until FF FF FF
      if (inFrame) {
        if (fLen < sizeof(fBuf)) fBuf[fLen++] = b;

        if (b == 0xFF) ffCount++; else ffCount = 0;

        if (ffCount >= 3) {
          // end of frame
          handleFrame();
          resetFrame();
        }
        continue;
      }

      // Start of binary frame?
      // IMPORTANT: do NOT treat '\r'/'\n' as binary, because those are our ASCII delimiters.
      const bool isAsciiDelimiter = (b == '\n' || b == '\r');
      const bool isKnownBinaryLead = (b == 0x65 || b == 0x66 || b == 0x67 || b == 0x68 || b == 0x70 || b == 0x71 || b == 0xFE || b == 0xFD);
      const bool isControl = (b < 0x20) && !isAsciiDelimiter;

      if (isKnownBinaryLead || isControl) {
        inFrame = true;
        fLen = 0;
        ffCount = 0;
        fBuf[fLen++] = b;
        continue;
      }

      // ASCII command handling
      char c = (char)b;
      if (c == '\n') {
        out = lineBuf;
        lineBuf = "";
        out.trim();
        if (out.length()) return true;
      } else if (c == '\r') {
        // ignore CR
      } else {
        lineBuf += c;
        if (lineBuf.length() > 220) lineBuf = "";
      }
    }

    return false;
  }
} nx;

// ===========================================================
//                      PROFILE DEFAULTS
// ===========================================================
void initDefaultProfiles() {
  for(int c=0;c<3;c++){
    profiles[c][0] = {"United T1800 Normal Charge", 64.30f, 15.00f, 16.00f, 65, 85.00f};
    profiles[c][1] = {"United T1800 Fast Charge", 64.30f, 20.00f, 21.00f, 65, 85.00f};
    profiles[c][2] = {"Polytron Normal Charge", 84.00f, 10.00f, 11.00f, 65, 85.00f};
    profiles[c][3] = {"Polytron Fast Charge", 84.00f,  20.00f,  21.00f, 65, 85.00f};
    profiles[c][4] = {"Gesits Normal Charge", 84.00f, 10.00f, 11.00f, 65, 85.00f};
    profiles[c][5] = {"Gesits Fast Charge", 84.00f, 20.00f, 21.00f, 65, 85.00f};
    profiles[c][6] = {"Honda CUV-e", 55.00f, 10.00f, 11.00f, 65, 85.00f};
    profiles[c][7] = {"Honda ICON-e", 55.00f, 10.00f, 11.00f, 65, 85.00f};
    profiles[c][8] = {"Polytron EVO",  71.00f,  10.00f, 11.00f, 65, 85.00f};
    profiles[c][9] = {"Alpha Atom", 62.40f, 10.00f, 11.00f, 65, 85.00f};
  }
}

// ===========================================================
//                      NVS (PREFERENCES)
// ===========================================================
static void makeKey(char* out, size_t outSz, const char* field, uint8_t c, uint8_t m) {
  // keep same prefix to preserve backward compatibility of keys
  // format: v1_ch<idx>_m<idx>_<field>
  snprintf(out, outSz, "v1_ch%u_m%u_%s", (unsigned)c, (unsigned)m, field);
}

void saveProfileToNVS(uint8_t c, uint8_t m) {
  char k[32];
  auto &p = profiles[c][m];

  makeKey(k,sizeof(k),"lab",c,m);  prefs.putString(k, p.label);
  makeKey(k,sizeof(k),"vset",c,m); prefs.putFloat (k, p.vset_V);
  makeKey(k,sizeof(k),"iset",c,m); prefs.putFloat (k, p.iset_A);
  makeKey(k,sizeof(k),"ocp", c,m); prefs.putFloat (k, p.ocp_A);
  makeKey(k,sizeof(k),"otp", c,m); prefs.putInt   (k, p.otp_C);
  makeKey(k,sizeof(k),"lvp", c,m); prefs.putFloat (k, p.lvp_V);
}

void loadProfilesFromNVSOrDefault() {
  initDefaultProfiles();

  prefs.begin("spklu", false);

  // first boot init
  if (!prefs.getBool("inited", false)) {
    for(uint8_t c=0;c<3;c++) for(uint8_t m=0;m<10;m++) saveProfileToNVS(c,m);
    prefs.putBool("inited", true);
    return;
  }

  char k[32];
  for(uint8_t c=0;c<3;c++){
    for(uint8_t m=0;m<10;m++){
      makeKey(k,sizeof(k),"lab",c,m);  profiles[c][m].label = prefs.getString(k, profiles[c][m].label);
      makeKey(k,sizeof(k),"vset",c,m); profiles[c][m].vset_V= prefs.getFloat (k, profiles[c][m].vset_V);
      makeKey(k,sizeof(k),"iset",c,m); profiles[c][m].iset_A= prefs.getFloat (k, profiles[c][m].iset_A);
      makeKey(k,sizeof(k),"ocp", c,m); profiles[c][m].ocp_A = prefs.getFloat (k, profiles[c][m].ocp_A);
      makeKey(k,sizeof(k),"otp", c,m); profiles[c][m].otp_C = prefs.getInt   (k, profiles[c][m].otp_C);
      makeKey(k,sizeof(k),"lvp", c,m); profiles[c][m].lvp_V = prefs.getFloat (k, profiles[c][m].lvp_V);
    }
  }
}

