kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
// ===========================================================
//                      XY12550S MODBUS OPS
// ===========================================================

static inline bool xyOk(uint8_t c, uint8_t mbRes) {
  return (chEnabled(c) && (mbRes == nodes[c].ku8MBSuccess));
}

bool xySetOutput(uint8_t c, bool on) {
  if (!chEnabled(c)) return false;
  return xyOk(c, nodes[c].writeSingleRegister(0x0012, on ? 1 : 0)); // ONOFF
}

// Try to "enable" device/panel logic so ONOFF works even when LCD panel is still off.
// This does NOT intentionally turn output ON; it only prepares the stage.
// W5 FIX: delay() di sini memblokir loop(). Fungsi ini hanya dipanggil dari:
//   - setup()      : blocking OK karena belum masuk loop
//   - PANELALL cmd : diterima dari HMI, blocking singkat bisa ditoleransi
//   - SETSAVE cmd  : diterima dari HMI, blocking singkat bisa ditoleransi
// Delay dikurangi ke minimum yang aman berdasarkan datasheet XY12550S.
bool xyEnableStage(uint8_t c) {
  if (!chEnabled(c)) return false;

  // 1) unlock (some units block ONOFF when locked)
  nodes[c].writeSingleRegister(REG_LOCK, 0);
  delay(20); // W5 FIX: dikurangi dari 30ms ke 20ms

  // 2) enable device logic (if supported by your XY firmware)
  nodes[c].writeSingleRegister(REG_DEVICE, 1);
  delay(50); // W5 FIX: dikurangi dari 80ms ke 50ms

  // 3) safety: make sure output is OFF before we proceed
  nodes[c].writeSingleRegister(0x0012, 0);
  delay(10); // W5 FIX: dikurangi dari 20ms ke 10ms

  // Optional verify (non-fatal)
  nodes[c].readHoldingRegisters(REG_DEVICE, 1);
  nodes[c].readHoldingRegisters(REG_LOCK, 1);
  return true;
}


bool xyExtractM(uint8_t c, uint8_t m) {
  if (!chEnabled(c)) return false;
  return xyOk(c, nodes[c].writeSingleRegister(0x001D, m)); // EXTRACT-M
}

bool xySelectDataSet(uint8_t c, uint8_t m) {
  if (!chEnabled(c)) return false;
  if (SW_CLF_FORCE_OFF_BEFORE_SWITCH) {
    xySetOutput(c, false);
    delay(SW_CLF_DELAY_MS);
  }
  bool ok = xyExtractM(c, m);
  if (SW_CLF_FORCE_OFF_BEFORE_SWITCH) delay(SW_CLF_DELAY_MS);
  return ok;
}

// Build 15 regs for group base..base+0x0E
void buildGroupRegs15(const MotorProfile& p, uint16_t regs[15]) {
  for(int i=0;i<15;i++) regs[i]=0;

  // default rules (can be expanded later per profile)
  float ovp  = p.vset_V * 1.05f;
  float oppW = p.vset_V * p.ocp_A;

  regs[0]  = regV100(p.vset_V);
  regs[1]  = regA100(p.iset_A);
  regs[2]  = regV100(p.lvp_V);
  regs[3]  = regV100(ovp);
  regs[4]  = regA100(p.ocp_A);
  regs[5]  = clampU16((int32_t)lroundf(oppW * XY_OPP_SCALE)); // 0.1W

  regs[6]  = 0; regs[7]=0;   // OHP off
  regs[8]  = 0; regs[9]=0;   // OAH off
  regs[10] = 0; regs[11]=0;  // OWH off

  regs[12] = (uint16_t)p.otp_C;
  regs[13] = 0; // INI default
  regs[14] = 0; // ETP off
}

bool xyWriteGroup15(uint8_t c, uint8_t m, const MotorProfile& p) {
  if (!chEnabled(c)) return false;

  uint16_t base = 0x0050 + (uint16_t)m * 0x0010;
  uint16_t regs[15];
  buildGroupRegs15(p, regs);
  for(int i=0;i<15;i++) nodes[c].setTransmitBuffer(i, regs[i]);
  return xyOk(c, nodes[c].writeMultipleRegisters(base, 15));
}

bool xyVerifyGroup(uint8_t c, uint8_t m, const MotorProfile& p) {
  if (!chEnabled(c)) return false;

  uint16_t base = 0x0050 + (uint16_t)m * 0x0010;
  uint8_t res = nodes[c].readHoldingRegisters(base, 15); // offsets 0..14
  if (!xyOk(c, res)) return false;

  auto get = [&](uint16_t off){ return nodes[c].getResponseBuffer(off); };

  // BUGFIX: pakai konstanta skala yang SAMA dengan sisi tulis (buildGroupRegs15),
  // supaya verify tidak selalu gagal bila XY_A_SCALE/XY_V_SCALE diubah kelak.
  float vset = get(0) / XY_V_SCALE;
  float iset = get(1) / XY_A_SCALE;
  float lvp  = get(2) / XY_V_SCALE;
  float ovp  = get(3) / XY_V_SCALE;
  float ocp  = get(4) / XY_A_SCALE;
  float opp  = get(5) / XY_OPP_SCALE;

  uint16_t ohp_h = get(6);
  uint16_t ohp_m = get(7);
  uint16_t oah_l = get(8);
  uint16_t oah_h = get(9);
  uint16_t owh_l = get(10);
  uint16_t owh_h = get(11);

  int otp   = (int)get(12);
  uint16_t ini = get(13);
  uint16_t etp = get(14);

  float ovpExp  = p.vset_V * 1.05f;
  float oppExpW = p.vset_V * p.ocp_A;

  if (fabsf(vset - p.vset_V) > TOL_V) return false;
  if (fabsf(iset - p.iset_A) > TOL_A) return false;
  if (fabsf(lvp  - p.lvp_V ) > TOL_LVP) return false;
  if (fabsf(ovp  - ovpExp ) > TOL_V) return false;
  if (fabsf(ocp  - p.ocp_A) > TOL_A) return false;
  if (fabsf(opp  - oppExpW) > 1.0f) return false; // power tolerance (W)

  // expected to be off by default
  if (ohp_h != 0 || ohp_m != 0) return false;
  if (oah_l != 0 || oah_h != 0) return false;
  if (owh_l != 0 || owh_h != 0) return false;

  if (otp != p.otp_C) return false;
  if (ini != 0) return false;
  if (etp != 0) return false;

  return true;
}

bool xyReadBlock(uint8_t c) {
  if (!chEnabled(c)) return false;

  // 0x0000..0x0014 (21 registers)
  uint8_t res = nodes[c].readHoldingRegisters(0x0000, 0x0015);
  if (!xyOk(c, res)) return false;

  auto &r = ch[c].r;

  uint16_t vset = nodes[c].getResponseBuffer(0x0000);
  uint16_t iset = nodes[c].getResponseBuffer(0x0001);
  uint16_t vout = nodes[c].getResponseBuffer(0x0002);
  uint16_t iout = nodes[c].getResponseBuffer(0x0003);
  uint16_t pwr  = nodes[c].getResponseBuffer(0x0004);
  uint16_t uin  = nodes[c].getResponseBuffer(0x0005);

  uint16_t wh_l = nodes[c].getResponseBuffer(0x0008);
  uint16_t wh_h = nodes[c].getResponseBuffer(0x0009);

  uint16_t out_h= nodes[c].getResponseBuffer(0x000A);
  uint16_t out_m= nodes[c].getResponseBuffer(0x000B);
  uint16_t out_s= nodes[c].getResponseBuffer(0x000C);

  uint16_t t_in = nodes[c].getResponseBuffer(0x000D);
  uint16_t t_ex = nodes[c].getResponseBuffer(0x000E);

  uint16_t pr   = nodes[c].getResponseBuffer(0x0010);
  uint16_t cvcc = nodes[c].getResponseBuffer(0x0011);
  uint16_t onoff= nodes[c].getResponseBuffer(0x0012);

  r.vset  = vset / XY_V_SCALE;
  r.iset  = iset / XY_A_SCALE;
  r.vout  = vout / XY_V_SCALE;
  r.iout  = iout / XY_A_SCALE;
  r.power = pwr  / 10.0f; // 0.1W/LSB pada unit ini (datasheet radix 2 = 0.01W; penulis merevisi ke /10 sesuai pengukuran). Tidak memengaruhi billing.
  r.uin   = uin  / XY_V_SCALE;

  r.wh_mWh= ((uint32_t)wh_h << 16) | wh_l;
  r.out_seconds = (uint32_t)out_h*3600UL + (uint32_t)out_m*60UL + out_s;

