kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
  // Temperature: assume 0.1°C scaling
  r.t_in = t_in / 10.0f;
  r.t_ex = t_ex / 10.0f;

  r.protect = pr;
  r.cvcc = cvcc;
  r.onoff = onoff;

  return true;
}

// Baca blok dengan beberapa percobaan cepat untuk menahan glitch transien
// pada bus RS485 (CRC/timeout sesekali) sebelum dihitung sebagai kegagalan.
bool xyReadBlockRetry(uint8_t c, uint8_t attempts) {
  for (uint8_t i = 0; i < attempts; i++) {
    if (xyReadBlock(c)) return true;
  }
  return false;
}

bool writeReg(uint8_t c, uint16_t reg, uint16_t val)
{
  if (c >= 3) return false;
  uint8_t sid = SLAVE_ID[c];
  if (sid == 0) return false;

  nodes[c].begin(sid, SerialModbus);
  uint8_t r = nodes[c].writeSingleRegister(reg, val);
  return (r == nodes[c].ku8MBSuccess);
}


void xyPanelSet(bool awake)
{
  static int8_t last = -1;
  if ((int8_t)awake == last) return;
  last = awake;

  for (uint8_t c = 0; c < 3; c++)
  {
    if (SLAVE_ID[c] == 0) continue;

    if (awake)
    {
      writeReg(c, REG_SLEEP, XY_SLEEP_MINUTES);
      writeReg(c, REG_LOCK, 0);                 // unlock
      writeReg(c, REG_BLED, XY_BLED_WAKE);      // backlight on
    }
    else
    {
      writeReg(c, REG_BLED, XY_BLED_SLEEP);     // backlight off
      writeReg(c, REG_LOCK, 1);                 // lock
      writeReg(c, REG_SLEEP, XY_SLEEP_MINUTES);
    }
    delay(20);
  }
}



// ===========================================================
//                     SESSION / BILLING
// ===========================================================
void resetSession(uint8_t c) {
  ch[c].sessionWhStart_mWh = ch[c].r.wh_mWh;
  ch[c].sessionWhLast_mWh  = ch[c].r.wh_mWh;  // BUGFIX billing: baseline akumulator
  ch[c].sessionWhAccum_mWh = 0;
  ch[c].sessionStartMillis = millis();
}

// BUGFIX billing (revisi W3): akumulasi energi sesi secara INKREMENTAL supaya tahan
// terhadap RESET counter energi modul XY (mis. modul power-cycle saat ESP32 tetap
// hidup). Versi lama me-rebaseline ke nilai sekarang saat now<base sehingga energi
// pra-reset HILANG (under-billing); komentar lama soal "threshold 500Wh" tak pernah
// terimplementasi. Dipanggil sekali per poll (pada pembacaan sukses).
void sessionAccumulate(uint8_t c) {
  uint32_t now  = ch[c].r.wh_mWh;
  uint32_t last = ch[c].sessionWhLast_mWh;
  if (now >= last) ch[c].sessionWhAccum_mWh += (now - last);
  else             ch[c].sessionWhAccum_mWh += now; // counter modul ter-reset -> energi sejak reset
  ch[c].sessionWhLast_mWh = now;
}

float sessionKWh(uint8_t c) {
  return ch[c].sessionWhAccum_mWh / 1000000.0f;
}

uint32_t sessionSec(uint8_t c) {
  return (millis() - ch[c].sessionStartMillis) / 1000UL;
}

// timer helpers (prototypes)
static inline void tmrStart(uint8_t c);
static inline void tmrStop(uint8_t c);
static inline void tmrReset(uint8_t c);
static inline uint32_t tmrSec(uint8_t c);

// UI mode indicator — definisi di bawah bersama backend
void uiUpdateMode();
static void saveRequireAuth();

// Backend / payment (Phase 2) — definisi lengkap di bawah, gate ENABLE_BACKEND.
// Dideklarasikan di sini supaya bisa dipanggil dari state machine di atasnya.
void backendInit();
void backendPoll();
void backendEmitSession(uint8_t c, const char* event);
void backendEmitFault(uint8_t c, const char* reason);
void backendCheckSessionLimit(uint8_t c);

static inline bool isChargeCompleteProtect(uint16_t pr) {
  return pr == 13;
}

// comm=true bila FAULT dipicu komunikasi Modbus hilang (boleh auto-recover),
// comm=false bila dipicu proteksi modul (butuh CLEAR manual).
void goFault(uint8_t c, bool comm=false) {
  xySetOutput(c, false);
  tmrStop(c);
  ch[c].faultIsComm = comm;
  ch[c].state = FAULT;

  // Phase 3 hardening: catat kejadian FAULT ke NVS (frekuensi rendah, hanya saat
  // transisi masuk FAULT) untuk diagnosa lapangan. Namespace "spklu" sudah terbuka.
  prefs.putUInt("fault_cnt", prefs.getUInt("fault_cnt", 0) + 1);
  prefs.putUShort("last_pr", ch[c].r.protect);
}

void goDone(uint8_t c) {
  xySetOutput(c, false);
  tmrStop(c);
  ch[c].done_kWh = sessionKWh(c);
  ch[c].done_rp  = (uint32_t)lroundf(ch[c].done_kWh * PRICE_PER_KWH);
  ch[c].done_sec = tmrSec(c);
  ch[c].state = DONE;
  // BUGFIX (security/billing): sesi berakhir -> cabut otorisasi (auth sekali pakai).
  ch[c].authorized = false;
  ch[c].limitType  = 0;
  backendEmitSession(c, "session_stop");
}

void goChargeComplete(uint8_t c) {
  xySetOutput(c, false);
  tmrStop(c);

  ch[c].done_kWh = sessionKWh(c);
  ch[c].done_rp  = (uint32_t)lroundf(ch[c].done_kWh * PRICE_PER_KWH);
  ch[c].done_sec = tmrSec(c);

  ch[c].state = PAUSED;
  setChanMsg(c, "Charging Complete - Resume Session", 0x362B, 5000);
  uiMsg("CHARGING COMPLETE", 0x362B);
  backendEmitSession(c, "session_complete");
}

// Dipanggil saat kabel terdeteksi dicabut paksa saat charging.
// Output dimatikan, sesi di-snapshot, tampil notif di HMI.
void goCabutKabel(uint8_t c) {
  xySetOutput(c, false);
  tmrStop(c);

  ch[c].done_kWh = sessionKWh(c);
  ch[c].done_rp  = (uint32_t)lroundf(ch[c].done_kWh * PRICE_PER_KWH);
  ch[c].done_sec = tmrSec(c);

  cabutCount[c]   = 0;
  cabutArmedMs[c] = 0;
  ch[c].state     = DONE;
  // BUGFIX (security/billing): kabel dicabut -> sesi berakhir, cabut otorisasi.
  ch[c].authorized = false;
  ch[c].limitType  = 0;

  char buf[64];
  snprintf(buf, sizeof(buf), "Kabel Dicabut | %.3f kWh | Rp %lu",
           ch[c].done_kWh, (unsigned long)ch[c].done_rp);
  setChanMsg(c, buf, 0xFCA0, 8000);
  uiMsg("KABEL DICABUT", 0xFCA0);
  backendEmitSession(c, "cable_unplug");
}

// ===========================================================
//              OCP AUTO-RECOVERY HANDLER (Phase 1)
// ===========================================================
// Dipanggil setiap loop untuk handle OCP retry state machine.
// Logic:
//   1. Jika protect != 2 (OCP), reset ocpState ke NONE
//   2. Jika protect == 2 dan ocpState == NONE, masuk RETRY
//   3. Jika ocpState == RETRY dan waktunya, coba turn ON lagi
//   4. Jika berhasil, kembali ke CHARGING
//   5. Jika gagal & exceed max retries, masuk FAULT (manual CLEAR)
void handleOCPRetry(uint8_t c) {
  if (!chEnabled(c)) return;

