kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
  // Bukan OCP (protect != 2): reset state machine OCP.
  if (ch[c].r.protect != 2) {
    if (ch[c].ocpState != Channel::OCP_NONE) {
      ch[c].ocpState = Channel::OCP_NONE;
      ch[c].ocpRetryCount = 0;
      ch[c].ocpLastProtectCode = 0;
    }
    return;
  }

  // ---- protect == 2 (OCP terdeteksi) ----

  // SAFETY: hanya auto-recover bila memang sedang sesi charging.
  // OCP di luar charging -> jangan energize output; minta CLEAR manual.
  if (ch[c].state != CHARGING && ch[c].ocpState == Channel::OCP_NONE) {
    ch[c].ocpState = Channel::OCP_FAULT;   // diteruskan ke FAULT oleh updateChannelState
    return;
  }

  // Pertama kali deteksi OCP saat charging -> mulai retry.
  if (ch[c].ocpState == Channel::OCP_NONE) {
    ch[c].ocpState        = Channel::OCP_RETRY;
    ch[c].ocpRetryCount   = 0;
    ch[c].ocpRetryUntilMs = millis() + OCP_RETRY_INTERVAL_MS;
    setChanMsg(c, "OCP terdeteksi, auto-retry...", 0xFCA0, 2500);
    return;
  }

  // Sudah menyerah -> tunggu CLEAR manual (output dijaga OFF oleh goFault()).
  if (ch[c].ocpState == Channel::OCP_FAULT) return;

  // ocpState == OCP_RETRY: tunggu jadwal, lalu coba ON lagi.
  if (ch[c].ocpState == Channel::OCP_RETRY) {
    // BUGFIX (interlock keselamatan): JANGAN re-energize bila channel sudah TIDAK
    // charging. STOP / e-stop / comm-fault mematikan output tanpa mereset ocpState,
    // sehingga tanpa guard ini retry akan menyalakan ulang output ~2.5s setelah
    // user berhenti. Bila bukan CHARGING -> batalkan retry & reset state OCP.
    if (ch[c].state != CHARGING) {
      ch[c].ocpState = Channel::OCP_NONE;
      ch[c].ocpRetryCount = 0;
      ch[c].ocpLastProtectCode = 0;
      return;
    }
    if ((int32_t)(millis() - ch[c].ocpRetryUntilMs) < 0) return; // belum waktunya

    ch[c].ocpRetryCount++;
    bool sent = xySetOutput(c, true);                 // coba energize ulang
    ch[c].ocpRetryUntilMs = millis() + OCP_RETRY_INTERVAL_MS;

    if (ch[c].ocpRetryCount >= OCP_MAX_RETRIES) {
      // Jatah retry habis -> FAULT, tunggu CLEAR manual.
      ch[c].ocpState = Channel::OCP_FAULT;
      goFault(c, false);                              // output OFF + state FAULT
      setChanMsg(c, "OCP - retry habis. Tekan CLEAR.", 0xF9C6, 5000);
      uiMsg("OCP FAULT - PRESS CLEAR", 0xF9C6);
      backendEmitFault(c, "ocp_fault");
      return;
    }

    char buf[48];
    snprintf(buf, sizeof(buf), "OCP retry %u/%u%s",
             (unsigned)ch[c].ocpRetryCount, (unsigned)OCP_MAX_RETRIES,
             sent ? "" : " (tx err)");
    setChanMsg(c, String(buf), 0xAD97, 1500);
  }
}

// Phase 3 hardening: alarm suhu dini (soft over-temp). TIDAK menggantikan OTP
// hardware XY-12550S — hanya peringatan/stop lebih awal. Dipanggil dari loop poll.
void checkOverTemp(uint8_t c) {
  if (!OTP_SOFT_ENABLE || !chEnabled(c)) return;
  float tmax = (ch[c].r.t_in > ch[c].r.t_ex) ? ch[c].r.t_in : ch[c].r.t_ex;
  if (tmax < OTP_WARN_C) return;

  // Peringatan (rate-limited, tahan millis() overflow via selisih signed).
  if ((int32_t)(millis() - otWarnMs[c]) >= 0) {
    otWarnMs[c] = millis() + OTP_WARN_INTERVAL_MS;
    char buf[40];
    snprintf(buf, sizeof(buf), "SUHU TINGGI %.0fC", tmax);
    setChanMsg(c, buf, 0xFCA0, 4000);
    backendEmitFault(c, "overtemp_warn");
  }

  // Soft-stop opsional: hentikan lebih awal sebelum OTP hardware memutus.
  if (OTP_SOFT_STOP && tmax >= OTP_STOP_C && ch[c].state == CHARGING) {
    xySetOutput(c, false);
    tmrStop(c);
    ch[c].done_kWh = sessionKWh(c);
    ch[c].done_rp  = (uint32_t)lroundf(ch[c].done_kWh * PRICE_PER_KWH);
    ch[c].done_sec = tmrSec(c);
    // konsisten dengan transisi DONE lain: reset cabut/OCP & cabut otorisasi.
    cabutCount[c]   = 0;
    cabutArmedMs[c] = 0;
    ch[c].ocpState  = Channel::OCP_NONE;
    ch[c].ocpRetryCount = 0;
    ch[c].authorized = false;
    ch[c].limitType  = 0;
    ch[c].state = DONE;
    setChanMsg(c, "STOP: suhu terlalu tinggi", 0xF9C6, 6000);
    backendEmitSession(c, "overtemp_stop");
  }
}

void updateChannelState(uint8_t c) {
  if (!chEnabled(c)) return;

  // Comm fault (Modbus hilang) -> FAULT yang boleh auto-recover saat pulih.
  if (ch[c].modbusFailCount >= MODBUS_FAIL_LIMIT) {
    if (ch[c].state != FAULT) goFault(c, true);
    return;
  }

  uint16_t pr = ch[c].r.protect;

  // OCP (protect==2): JANGAN langsung FAULT. Serahkan ke handleOCPRetry().
  // Baru jadi FAULT bila retry sudah menyerah (ocpState==OCP_FAULT).
  if (pr == 2) {
    if (ch[c].ocpState == Channel::OCP_FAULT && ch[c].state != FAULT) {
      goFault(c, false);
    }
    return; // selama retry, biarkan handleOCPRetry yang mengatur output
  }

  if (pr != 0) {
    if (isChargeCompleteProtect(pr)) {            // pr==13: charging complete
      if (ch[c].state == CHARGING) goChargeComplete(c);
      return;
    } else {                                      // proteksi lain -> FAULT (CLEAR manual)
      goFault(c, false);
      return;
    }
  }

  // ---------------------- pr == 0 (normal) ----------------------

  if (ch[c].state == CHARGING && ch[c].r.onoff == 0) {
    goDone(c);
    return;
  }

  if ((ch[c].state == IDLE || ch[c].state == SELECT || ch[c].state == DONE || ch[c].state == PAUSED) &&
      ch[c].r.onoff == 1) {
    ch[c].state = CHARGING;
  }

  // Auto-recovery comm-fault: jika sebelumnya FAULT karena komunikasi dan
  // sekarang Modbus sehat lagi tanpa proteksi, kembalikan agar bisa dipakai.
  if (ch[c].state == FAULT && ch[c].faultIsComm) {
    ch[c].faultIsComm = false;
    if (ch[c].r.onoff == 1) {
      // Modul ternyata masih charging (perintah OFF saat comm putus tak sampai).
      ch[c].state = CHARGING;
      tmrStart(c);                                   // lanjutkan timer durasi
      cabutCount[c]   = 0;
      cabutArmedMs[c] = millis() + CABUT_ARM_DELAY_MS;
    } else {
      ch[c].state = IDLE;
    }
    setChanMsg(c, "Komunikasi pulih", 0x362B, 2500);
    backendEmitSession(c, "comm_recovered");
  }

  // -------------------------------------------------------
  //  Deteksi kabel dicabut paksa
  //  Hanya aktif setelah CABUT_ARM_DELAY_MS dari START.
  //  Cek: millis() sudah melewati cabutArmedMs[c]
  //  (selisih < 0x80000000 = sudah lewat, >= = belum lewat)
  // -------------------------------------------------------
  if (ch[c].state == CHARGING && ch[c].r.onoff == 1) {
    bool masihGracePeriod = (cabutArmedMs[c] == 0) ||
                            ((millis() - cabutArmedMs[c]) >= 0x80000000UL);
    if (masihGracePeriod) {
      cabutCount[c] = 0;
    } else {
      bool bebanHilang = (ch[c].r.iout < CABUT_IOUT_THRESHOLD_A)
                      && (ch[c].r.iset >= CABUT_ISET_MIN_A);
      if (bebanHilang) {
        cabutCount[c]++;
        if (cabutCount[c] >= CABUT_CONFIRM_SAMPLES) {
          goCabutKabel(c);
        }
      } else {
        cabutCount[c] = 0;
      }
    }

    // Batas sesi berbayar (Phase 2): auto-STOP saat kWh/Rp/durasi tercapai.
    backendCheckSessionLimit(c);
  } else {
    cabutCount[c] = 0;
  }
}


