kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
// ===================  Helper Timer  ==========================

static inline void tmrStart(uint8_t c){
  if (!runRunning[c]) { runRunning[c] = true; runStartMs[c] = millis(); }
}
static inline void tmrStop(uint8_t c){
  if (runRunning[c]) {
    runMsAccum[c] += (millis() - runStartMs[c]);
    runRunning[c] = false;
  }
}
static inline void tmrReset(uint8_t c){
  runMsAccum[c] = 0;
  runRunning[c] = false;
  runStartMs[c] = millis();
}
static inline uint32_t tmrSec(uint8_t c){
  uint32_t ms = runMsAccum[c] + (runRunning[c] ? (millis() - runStartMs[c]) : 0);
  return ms / 1000UL;
}


// ===========================================================
//                      UI UPDATE (MINIMAL)
// ===========================================================
String fmt1(float v){ char b[24]; snprintf(b,sizeof(b),"%.1f",v); return String(b); }
String fmt2(float v){ char b[24]; snprintf(b,sizeof(b),"%.2f",v); return String(b); }

String prShort(uint16_t pr) {
  switch(pr){
    case 0:  return "OK";
    case 1:  return "OVP";
    case 2:  return "OCP";
    case 3:  return "OPP";
    case 4:  return "LVP";
    case 5:  return "OAH";
    case 6:  return "OHP";
    case 7:  return "OTP";
    case 8:  return "OEP";
    case 9:  return "OWH";
    case 10: return "ICP";
    case 11: return "ETP";
    case 13: return "CHG DONE";
    default: return "PR=" + String(pr);
  }
}

uint16_t stColor(uint8_t c) {
  if (!chEnabled(c)) return 0x7BEF; // gray
  if (ch[c].modbusFailCount >= MODBUS_FAIL_LIMIT) return 0xF9C6; // red-ish
  if (ch[c].r.protect == 0 || isChargeCompleteProtect(ch[c].r.protect)) return 0x362B; // green
  return 0xFCA0; // orange
}

void uiHighlightMotor(uint8_t motorIdx) {
  for (int i = 0; i < 10; i++) {
    nxSendCmd("b_m" + String(i) + ".bco="  + String(MOTOR_INACTIVE_BCO));
    nxSendCmd("b_m" + String(i) + ".pco="  + String(MOTOR_INACTIVE_PCO));
    nxSendCmd("b_m" + String(i) + ".bco2=" + String(MOTOR_INACTIVE_BCO));
  }

  nxSendCmd("b_m" + String(motorIdx) + ".bco="  + String(MOTOR_ACTIVE_BCO));
  nxSendCmd("b_m" + String(motorIdx) + ".pco="  + String(MOTOR_ACTIVE_PCO));
  nxSendCmd("b_m" + String(motorIdx) + ".bco2=" + String(MOTOR_ACTIVE_BCO));
}

void uiSetMotorLabels(uint8_t c) {
  for(int i=0;i<10;i++){
    nxSendCmd("b_m"+String(i)+".txt=\""+profiles[c][i].label+"\"");
    delay(1);
  }
}

void uiSetChannelDisabledCard(uint8_t idx) {
  // idx: 0..2, components: t1_, t2_, t3_
  // W2 FIX: snprintf menggantikan String concat
  char buf[32];
  const char* p = (idx==0) ? "t1_" : (idx==1) ? "t2_" : "t3_";
  snprintf(buf, sizeof(buf), "%smot.txt=\"-\"",      p); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "%sst.txt=\"DISABLED\"", p); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "%sst.pco=0x7BEF",       p); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "%sv.txt=\"-\"",          p); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "%si.txt=\"-\"",          p); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "%sp.txt=\"-\"",          p); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "%sset.txt=\"-\"",        p); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "%skwh.txt=\"-\"",        p); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "%srp.txt=\"-\"",         p); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "%stm.txt=\"-\"",         p); nxSendCmd(buf);
}

void uiUpdateMonitor() {
  // W2 FIX: gunakan char buf + snprintf untuk menghindari fragmentasi heap
  // dari puluhan String sementara setiap 250ms
  char buf[80];

  for(int c=0;c<3;c++){
    if(!chEnabled(c)) { uiSetChannelDisabledCard(c); continue; }

    float kwh = sessionKWh(c);
    uint32_t rp = (uint32_t)lroundf(kwh * PRICE_PER_KWH);
    uint32_t sec = tmrSec(c);
    char tb[16]; snprintf(tb,sizeof(tb),"%02lu:%02lu:%02lu",sec/3600,(sec%3600)/60,sec%60);

    const char* pref_s = (c==0) ? "t1_" : (c==1) ? "t2_" : "t3_";

    snprintf(buf, sizeof(buf), "%s%s", pref_s, "mot.txt=\"");
    String mcmd = String(buf) + profiles[c][ch[c].motorIdx].label + "\"";
    nxSendCmd(mcmd);

    String st;
    if (isChargeCompleteProtect(ch[c].r.protect)) {
      st = "OFF | Charging Complete";
    } else {
      st = (ch[c].r.onoff ? "ON" : "OFF");
      st += (ch[c].r.cvcc == 0 ? " | CV | " : " | CC | ");
      st += prShort(ch[c].r.protect);
    }

    snprintf(buf, sizeof(buf), "%sst.txt=\"", pref_s);
    nxSendCmd(String(buf) + st + "\"");
    snprintf(buf, sizeof(buf), "%sst.pco=%u", pref_s, stColor(c));
    nxSendCmd(buf);

    char vb[12], ib[12], pb[12], vsetb[12], isetb[12];
    snprintf(vb,    sizeof(vb),    "%.2fV",  ch[c].r.vout);
    snprintf(ib,    sizeof(ib),    "%.2fA",  ch[c].r.iout);
    snprintf(pb,    sizeof(pb),    "%.2fW",  ch[c].r.power);
    snprintf(vsetb, sizeof(vsetb), "%.2fV",  ch[c].r.vset);
    snprintf(isetb, sizeof(isetb), "%.2fA",  ch[c].r.iset);

    snprintf(buf, sizeof(buf), "%sv.txt=\"%s\"",   pref_s, vb);    nxSendCmd(buf);
    snprintf(buf, sizeof(buf), "%si.txt=\"%s\"",   pref_s, ib);    nxSendCmd(buf);
    snprintf(buf, sizeof(buf), "%sp.txt=\"%s\"",   pref_s, pb);    nxSendCmd(buf);
    snprintf(buf, sizeof(buf), "%sset.txt=\"SET %s / %s\"", pref_s, vsetb, isetb); nxSendCmd(buf);

    snprintf(buf, sizeof(buf), "%skwh.txt=\"%.3f kWh\"", pref_s, kwh); nxSendCmd(buf);
    snprintf(buf, sizeof(buf), "%srp.txt=\"Rp %lu\"",    pref_s, (unsigned long)rp); nxSendCmd(buf);
    snprintf(buf, sizeof(buf), "%stm.txt=\"%s\"",        pref_s, tb); nxSendCmd(buf);
  }
}

void uiUpdateChannel(uint8_t c) {
  // W2 FIX: semua UI update pakai char buf + snprintf, bukan String concatenation
  char buf[96];

  if (!chEnabled(c)) {
    snprintf(buf, sizeof(buf), "CH%u DISABLED", (unsigned)(c+1));
    uiMsg(buf, 0xFCA0);
    nxSendCmd("page page_welcome");
    return;
  }

  float kwh = sessionKWh(c);
  uint32_t rp = (uint32_t)lroundf(kwh * PRICE_PER_KWH);
  uint32_t sec = tmrSec(c);
  char tb[16]; snprintf(tb,sizeof(tb),"%02lu:%02lu:%02lu",sec/3600,(sec%3600)/60,sec%60);

  snprintf(buf, sizeof(buf), "t_ch.txt=\"CH%u\"", (unsigned)(c+1)); nxSendCmd(buf);
  nxSendCmd("t_mot.txt=\"" + profiles[c][ch[c].motorIdx].label + "\"");

  String st;
  if (isChargeCompleteProtect(ch[c].r.protect)) {
    st = "OFF | Charging Complete";
  } else {
    st = (ch[c].r.onoff ? "ON" : "OFF");
    st += (ch[c].r.cvcc == 0 ? " | CV | " : " | CC | ");
    st += prShort(ch[c].r.protect);
  }
  nxSendCmd("t_st.txt=\"" + st + "\"");
  snprintf(buf, sizeof(buf), "t_st.pco=%u", stColor(c)); nxSendCmd(buf);

