kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
  snprintf(buf, sizeof(buf), "t_v.txt=\"%.2fV\"",  ch[c].r.vout);  nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "t_i.txt=\"%.2fA\"",  ch[c].r.iout);  nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "t_p.txt=\"%.2fW\"",  ch[c].r.power); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "t_set.txt=\"SET %.2fV / %.2fA\"", ch[c].r.vset, ch[c].r.iset); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "t_uin.txt=\"UIN %.2fV\"", ch[c].r.uin); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "t_tmp.txt=\"TIN %.1fC TEX %.1fC\"", ch[c].r.t_in, ch[c].r.t_ex); nxSendCmd(buf);
  nxSendCmd("t_pr.txt=\"PROTECT " + String(ch[c].r.protect) + " (" + prShort(ch[c].r.protect) + ")\"");

  snprintf(buf, sizeof(buf), "t_pay.txt=\"Rp %lu\"",   (unsigned long)rp); nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "t_kwh.txt=\"%.3f kWh\"", kwh);               nxSendCmd(buf);
  snprintf(buf, sizeof(buf), "t_tm.txt=\"%s\"",        tb);                nxSendCmd(buf);

  // optional summary line / transient messages
  // B2 FIX: gunakan chanMsgExpired() yang tahan millis() overflow
  if (!chanMsgExpired(c) && chanMsgText[c].length()) {
    nxSendCmd("g_sum.txt=\"" + chanMsgText[c] + "\"");
    nxSendCmd("g_sum.pco=" + String(chanMsgColor[c]));
  } else if (ch[c].state == DONE || ch[c].state == PAUSED) {
    uint32_t s = ch[c].done_sec;
    char dtb[16];
    snprintf(dtb,sizeof(dtb),"%02lu:%02lu:%02lu", s/3600, (s%3600)/60, s%60);

    String sumText;
    if (ch[c].state == PAUSED) {
      if (isChargeCompleteProtect(ch[c].r.protect)) {
        sumText = "Charging Complete | Last Session | " + String(ch[c].done_kWh,3) +
                  " kWh | Rp " + String(ch[c].done_rp) +
                  " | " + String(dtb);
      } else {
        sumText = "Paused | Last Session | " + String(ch[c].done_kWh,3) +
                  " kWh | Rp " + String(ch[c].done_rp) +
                  " | " + String(dtb);
      }
    } else {
      sumText = "Done: " + String(ch[c].done_kWh,3) +
                " kWh | Rp " + String(ch[c].done_rp) +
                " | " + String(dtb);
    }

    nxSendCmd("g_sum.txt=\"" + sumText + "\"");
    nxSendCmd("g_sum.pco=0x362B");
  }


}


// ===========================================================
//                  SETTINGS PAGE UI HELPERS
//  Expected components on each setting_CHn page (recommended):
//   - t_sch (optional): header text
//   - t_motor: motor label (e.g. "M3 Vario")
//   - t_vset, t_iset, t_lvp, t_ocp, t_otp: value texts
//   - t_msg: status text (shared with uiMsg())
//   - optional motor buttons b_m0..b_m9 for direct selection
// ===========================================================
void goToChannelPage(uint8_t c){
  // expects page names: p1_ch1 / p2_ch2 / p3_ch3
  nxSendCmd("page p"+String(c+1)+"_ch"+String(c+1));
}

void uiUpdateSetting(uint8_t c){
  if (!chEnabled(c)) return;

  uint8_t m = ch[c].editMotorIdx;
  const auto &p = ch[c].editProfile;

  nxSendCmd("t_sch.txt=\"SETTING CH"+String(c+1)+"\""); // optional
  nxSendCmd("t_motor.txt=\"M"+String(m)+" "+profiles[c][m].label+"\"");
  nxSendCmd("t_vset.txt=\""+fmt2(p.vset_V)+" V\"");
  nxSendCmd("t_iset.txt=\""+fmt2(p.iset_A)+" A\"");
  nxSendCmd("t_lvp.txt=\""+fmt2(p.lvp_V)+" V\"");
  nxSendCmd("t_ocp.txt=\""+fmt2(p.ocp_A)+" A\"");
  nxSendCmd("t_otp.txt=\""+String(p.otp_C)+" C\"");
}

void uiEnterPage(uint8_t page) {
  uiUpdateMode(); // selalu refresh indikator mode di header HMI
  if (page == 0) {
    uiUpdateMonitor();
  } else if (page >= 1 && page <= 3) {
    uint8_t c = page - 1;
    if (!chEnabled(c)) {
      uiMsg("CH"+String(c+1)+" DISABLED", 0xFCA0);
      nxSendCmd("page p0_mon");
      return;
    }
    uiSetMotorLabels(c);
    uiHighlightMotor(ch[c].motorIdx);
    uiUpdateChannel(c);
  }
}

// ===========================================================
//                      COMMAND UTIL
// ===========================================================
static inline bool parseChannel(const String& s, int startIdx, uint8_t &outC) {
  int chNum = s.substring(startIdx).toInt();
  if (chNum < 1 || chNum > 3) return false;
  outC = (uint8_t)(chNum - 1);
  return true;
}

static inline bool ensureChannelEnabled(uint8_t c) {
  if (!chEnabled(c)) {
    uiMsg("CHANNEL DISABLED", 0xFCA0);
    return false;
  }
  return true;
}

// ===========================================================
//                      COMMAND HANDLER
// ===========================================================
void handleCmd(const String &cmd) {
  if (cmd == "SLEEP") {
  xyPanelSet(false);
  return;
}
if (cmd == "WAKE") {
  xyPanelSet(true);
  return;
}

if (!cmd.length()) return;

if (cmd == "SETONLINE") {
  requireAuth = true;
  saveRequireAuth();
  uiUpdateMode();
  uiMsg("MODE: PAYMENT (ONLINE)", 0x362B);
  return;
}
if (cmd == "SETOFFLINE") {
  requireAuth = false;
  saveRequireAuth();
  uiUpdateMode();
  uiMsg("MODE: FREE (OFFLINE)", 0xAD97);
  return;
}

if (cmd == "PANELALL") {
  uiMsg("Starting...", 0xAD97);

  bool any = false;
  bool allOk = true;

  for (uint8_t c = 0; c < 3; c++) {
    if (!chEnabled(c)) continue;
    any = true;

    // enable stage/panel logic (fungsi yang kemarin kamu pakai dan sudah terbukti bisa)
    bool ok = xyEnableStage(c);

    // safety extra: pastikan output OFF
    xySetOutput(c, false);

    if (!ok) allOk = false;
    delay(30);
  }

  if (!any) {
    uiMsg("NO CHANNEL ENABLED", 0xFCA0);
    nxSendCmd("page p0_mon");
    return;
  }

  if (allOk) uiMsg("PANEL READY", 0x362B);
  else       uiMsg("PANEL READY (PARTIAL)", 0xFCA0);

  // pindah ke monitoring
  delay (30);
  nxSendCmd("page p0_mon");
  return;
}


  // SETOPEN,<ch>
  if (cmd.startsWith("SETOPEN,")) {
    uint8_t c;
    if (!parseChannel(cmd, 8, c)) return;
    if (!ensureChannelEnabled(c)) return;

    // NOTE: We no longer auto-bounce back to channel page.
// If CHARGING/FAULT, we still show current saved values, but editing/saving is blocked.
bool locked = false;
if (ch[c].state == CHARGING) { locked = true; }
if (ch[c].state == FAULT)    { locked = true; }

ch[c].settingOpen = true;
    ch[c].editMotorIdx = ch[c].motorIdx;
    ch[c].editProfile = profiles[c][ch[c].editMotorIdx];
    ch[c].editDirty = false;

    uiSetMotorLabels(c);
    uiHighlightMotor(ch[c].editMotorIdx);
    uiUpdateSetting(c);
    if (locked) {
      if (ch[c].state == CHARGING) uiMsg("STOP dulu (output ON)", 0xFCA0);
      else uiMsg("FAULT - CLEAR dulu", 0xFCA0);
    } else {
      uiMsg("READY", 0xAD97);
    }
    return;
  }

  // SETM,<ch>,<m>
  if (cmd.startsWith("SETM,")) {
    int p1 = cmd.indexOf(',', 5);
    if (p1 < 0) return;
    int chNum = cmd.substring(5, p1).toInt();
    int mIdx  = cmd.substring(p1+1).toInt();
    if (chNum < 1 || chNum > 3 || mIdx < 0 || mIdx > 9) return;

    uint8_t c = (uint8_t)(chNum - 1);
    if (!ensureChannelEnabled(c)) return;

