kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
    if (ch[c].state == CHARGING) { uiMsg("STOP dulu (output ON)", 0xFCA0); return; }
    if (ch[c].state == FAULT)    { uiMsg("CLEAR FAULT dulu", 0xFCA0); return; }

    ch[c].settingOpen = true;
    ch[c].editMotorIdx = (uint8_t)mIdx;
    ch[c].editProfile = profiles[c][ch[c].editMotorIdx];
    ch[c].editDirty = false;

    uiHighlightMotor(ch[c].editMotorIdx);
    uiUpdateSetting(c);
    return;
  }

  // ADJ,<ch>,FIELD,delta
  // delta is integer in device-units:
  // - VSET/LVP: centi-volt (0.01V) -> delta=10 means +0.10V
  // - ISET/OCP: centi-amp  (0.01A) -> delta=10 means +0.10A
  // - OTP: degC integer
  if (cmd.startsWith("ADJ,")) {
    int pA = cmd.indexOf(',', 4);
    int pB = (pA>=0) ? cmd.indexOf(',', pA+1) : -1;
    if (pA<0 || pB<0) return;

    int chNum = cmd.substring(4, pA).toInt();
    String field = cmd.substring(pA+1, pB);
    int delta = cmd.substring(pB+1).toInt();
    if (chNum < 1 || chNum > 3) return;
    uint8_t c = (uint8_t)(chNum - 1);

    if (!ensureChannelEnabled(c)) return;
    if (!ch[c].settingOpen) { uiMsg("OPEN setting dulu", 0xFCA0); return; }
    if (ch[c].state == CHARGING) { uiMsg("STOP dulu utk edit", 0xFCA0); return; }
    if (ch[c].state == FAULT)    { uiMsg("CLEAR FAULT dulu", 0xFCA0); return; }

    auto &p = ch[c].editProfile;

    if (field == "VSET")      p.vset_V = constrain(p.vset_V + delta/100.0f, 1.0f, 125.0f);
    else if (field == "ISET") p.iset_A = constrain(p.iset_A + delta/100.0f, 0.0f, 50.0f);
    else if (field == "OCP")  p.ocp_A  = constrain(p.ocp_A  + delta/100.0f, 0.1f, 52.0f);
    else if (field == "OTP")  p.otp_C  = constrain(p.otp_C  + delta, 60, 120);
    else if (field == "LVP")  p.lvp_V  = constrain(p.lvp_V  + delta/100.0f, 10.0f, 145.0f);

    // Safety: keep OCP >= ISET
    if (p.ocp_A < p.iset_A) p.ocp_A = p.iset_A;

    ch[c].editDirty = true;
    uiUpdateSetting(c);
    uiMsg("EDIT", 0xAD97);
    return;
  }

  // SETSAVE,<ch>
  if (cmd.startsWith("SETSAVE,")) {
    uint8_t c;
    if (!parseChannel(cmd, 8, c)) return;
    if (!ensureChannelEnabled(c)) return;

    if (!ch[c].settingOpen) { uiMsg("OPEN setting dulu", 0xFCA0); return; }
    if (ch[c].state == CHARGING) { uiMsg("STOP dulu sebelum save", 0xFCA0); return; }
    if (ch[c].state == FAULT)    { uiMsg("CLEAR FAULT dulu", 0xFCA0); return; }

    uint8_t m = ch[c].editMotorIdx;

    // Preserve label from stored profile
    MotorProfile p = ch[c].editProfile;
    p.label = profiles[c][m].label;

    // Safety: keep OCP >= ISET
    if (p.ocp_A < p.iset_A) p.ocp_A = p.iset_A;

    uiMsg("SAVING...", 0xAD97);

    // Pastikan stage enable/unlock dulu
    xyEnableStage(c);

    // safety: output OFF during write/verify (SW-CLF)
    xySetOutput(c, false);
    delay(SW_CLF_DELAY_MS);

    // Simpan ke NVS dulu supaya tetap persist walau write/verify modul gagal
    profiles[c][m] = p;
    saveProfileToNVS(c, m);

    bool okW = xyWriteGroup15(c, m, p);
    bool okV = okW ? xyVerifyGroup(c, m, p) : false;

    if (okW && okV) {
      // If editing current selected motor, re-apply dataset (forces OFF first)
      if (ch[c].motorIdx == m) {
        xySelectDataSet(c, m);
        xyReadBlock(c);
      }

      ch[c].settingOpen = false;
      ch[c].editDirty = false;

      uiMsg("SAVED", 0x362B);
      goToChannelPage(c);
      return;
    } else {
      ch[c].settingOpen = false;
      ch[c].editDirty = false;

      uiMsg("SAVED (LOCAL)", 0xFCA0);
      goToChannelPage(c);
      return;
    }
  }

  // SETBACK,<ch>
  if (cmd.startsWith("SETBACK,")) {
    uint8_t c;
    if (!parseChannel(cmd, 8, c)) return;
    if (!ensureChannelEnabled(c)) return;

    ch[c].settingOpen = false;
    ch[c].editDirty = false;
    uiMsg("CANCEL", 0xAD97);
    goToChannelPage(c);
    return;
  }

  // CLEAR,<ch>
  if (cmd.startsWith("CLEAR,")) {
  uint8_t c;
  if (!parseChannel(cmd, 6, c)) return;
  if (!ensureChannelEnabled(c)) return;

  // Paksa output OFF (aman)
  xySetOutput(c, false);

  // Ambil data terbaru (cukup sekali)
  if (!xyReadBlock(c)) {
    if (ch[c].modbusFailCount < 255) ch[c].modbusFailCount++;
    uiMsg("CLEAR: READ FAIL", 0xFCA0);
    return;
  }
  ch[c].modbusFailCount = 0;

  // Kalau masih proteksi, jangan reset timer/session
  if (ch[c].r.protect != 0 && !isChargeCompleteProtect(ch[c].r.protect)) {
    ch[c].state = FAULT;
    uiMsg("CANNOT CLEAR: " + prShort(ch[c].r.protect), 0xFCA0);
    return;
  }

  // Benar-benar clear -> reset timer + session base
  tmrReset(c);
  sessArmed[c]    = false;
  cabutCount[c]   = 0;
  cabutArmedMs[c] = 0;

  // ===== Phase 1: Reset OCP retry state =====
  ch[c].ocpState = Channel::OCP_NONE;
  ch[c].ocpRetryCount = 0;
  ch[c].ocpLastProtectCode = 0;
  ch[c].faultIsComm = false;

  // ===== Phase 2: Wipe sesi berbayar (siap untuk $AUTH berikutnya) =====
  ch[c].authorized   = false;
  ch[c].sessionId[0] = '\0';
  ch[c].limitType    = 0;
  ch[c].limitKwh     = 0.0f;
  ch[c].limitRp      = 0;
  ch[c].limitSec     = 0;
  ch[c].limitReached = false;

ch[c].done_kWh = 0;
ch[c].done_rp  = 0;
ch[c].done_sec = 0;

  resetSession(c);     // pakai WH yang baru dibaca di atas
  ch[c].state = IDLE;

  uiMsg("CLEARED", 0x362B);
  backendEmitSession(c, "cleared");
  return;
  } // akhir if CLEAR


  // SEL,<ch>,<m>
  // B1 FIX: blok ini sebelumnya berada di LUAR handleCmd() karena brace
  // penutup CLEAR salah menutup seluruh fungsi. Sekarang sudah benar.
  if (cmd.startsWith("SEL,")) {
    int p1 = cmd.indexOf(',', 4);
    if (p1 < 0) return;

    int chNum = cmd.substring(4, p1).toInt();
    int mIdx  = cmd.substring(p1+1).toInt();
    if (chNum < 1 || chNum > 3 || mIdx < 0 || mIdx > 9) return;

    uint8_t c = (uint8_t)(chNum - 1);
    if (!ensureChannelEnabled(c)) return;

    // Interlock
    if (ch[c].state == CHARGING) { setChanMsg(c, "STOP dulu (OUTPUT ON)", 0xFCA0); return; }
    if (ch[c].state == FAULT)    { setChanMsg(c, "FAULT - tekan CLEAR", 0xFCA0); return; }

    if (xySelectDataSet(c, (uint8_t)mIdx)) {
      ch[c].motorIdx = (uint8_t)mIdx;
      ch[c].state = SELECT;
      if (xyReadBlock(c)) resetSession(c);
      if (activePage == (uint8_t)(c+1)) uiHighlightMotor(ch[c].motorIdx);
      uiMsg("PROFILE SELECTED", 0xAD97);
    } else {
      uiMsg("SELECT FAILED", 0xF9C6);
    }
    return;
  }

