kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
  // START,<ch>
  if (cmd.startsWith("START,")) {
    uint8_t c;
    if (!parseChannel(cmd, 6, c)) return;
    if (!ensureChannelEnabled(c)) return;

    if (ch[c].state == FAULT) { uiMsg("FAULT - CLEAR dulu", 0xFCA0); return; }

    // Mode ONLINE: START dari HMI ditolak sebelum ada $AUTH dari backend
    if (requireAuth && !ch[c].authorized) {
      uiMsg("Scan QR / bayar dulu!", 0xF9C6);
      return;
    }

    xyReadBlock(c);

    if (!sessArmed[c]) {
      resetSession(c);
      sessArmed[c] = true;
    }

    if (xySetOutput(c, true)) {
      ch[c].state       = CHARGING;
      ch[c].limitReached = false;   // aktifkan kembali pemantauan batas sesi
      tmrStart(c);
      cabutCount[c]   = 0;
      cabutArmedMs[c] = millis() + CABUT_ARM_DELAY_MS; // aktif setelah 5 detik
      if (ch[c].done_sec > 0 || ch[c].done_kWh > 0.0f) uiMsg("RESUMED", 0x362B);
      else uiMsg("CHARGING...", 0x362B);
      backendEmitSession(c, "session_start");
    } else {
      uiMsg("START FAILED", 0xF9C6);
    }
    return;
  }

  // STOP,<ch>
  if (cmd.startsWith("STOP,")) {
    uint8_t c;
    if (!parseChannel(cmd, 5, c)) return;
    if (!ensureChannelEnabled(c)) return;

    xySetOutput(c, false);
    tmrStop(c);

    // BUGFIX (interlock): reset state OCP retry agar handleOCPRetry tidak
    // menyalakan ulang output setelah STOP (mirror blok CLEAR).
    ch[c].ocpState = Channel::OCP_NONE;
    ch[c].ocpRetryCount = 0;
    ch[c].ocpLastProtectCode = 0;

    // snapshot resume
    ch[c].done_kWh = sessionKWh(c);
    ch[c].done_rp  = (uint32_t)lroundf(ch[c].done_kWh * PRICE_PER_KWH);
    ch[c].done_sec = tmrSec(c);

    ch[c].state = PAUSED;
    uiMsg("PAUSED", 0xAD97);
    backendEmitSession(c, "session_stop");
    return;
  }
} // akhir handleCmd()


// ===========================================================
//                  BOOT SYNC (DETERMINISTIC)
//  Push only currently selected profile at boot (safe & fast).
// ===========================================================
bool pushSelectedProfileToModule(uint8_t c) {
  if (!chEnabled(c)) return false;

  uint8_t m = ch[c].motorIdx;
  bool okW = xyWriteGroup15(c, m, profiles[c][m]);
  bool okV = okW ? xyVerifyGroup(c, m, profiles[c][m]) : false;
  if (okW && okV) {
    xySelectDataSet(c, m);
    return true;
  }
  return false;
}

// ===========================================================
//                  PUSHBUTTON EMERGENCY STOP
// ===========================================================

// Identik dengan handleCmd("STOP,<c+1>") tapi tampil sebagai "Charging Complete"
void doStopChannel(uint8_t c) {
  if (!chEnabled(c)) return;
  if (ch[c].state != CHARGING) return;

  xySetOutput(c, false);
  tmrStop(c);

  // BUGFIX (interlock): reset state OCP retry agar tidak re-energize setelah e-stop.
  ch[c].ocpState = Channel::OCP_NONE;
  ch[c].ocpRetryCount = 0;
  ch[c].ocpLastProtectCode = 0;

  ch[c].done_kWh = sessionKWh(c);
  ch[c].done_rp  = (uint32_t)lroundf(ch[c].done_kWh * PRICE_PER_KWH);
  ch[c].done_sec = tmrSec(c);

  ch[c].state = DONE;
  // BUGFIX (security/billing): e-stop mengakhiri sesi -> cabut otorisasi berbayar.
  ch[c].authorized = false;
  ch[c].limitType  = 0;
  uiMsg("CHARGING COMPLETE", 0x362B);
  if (getActivePage() == (uint8_t)(c + 1))
    setChanMsg(c, "Charging Complete", 0x362B);
  backendEmitSession(c, "session_stop");
}

// Polling debounce pushbutton, dipanggil setiap loop().
// Deteksi FALLING edge (HIGH->LOW) = tombol ditekan = STOP.
void pollButtons() {
  uint32_t now = millis();
  for (uint8_t c = 0; c < 3; c++) {
    if (BTN_PIN[c] < 0) continue;
    if (!chEnabled(c))  continue;

    bool raw = (bool)digitalRead(BTN_PIN[c]);

    if (raw != btnLastRaw[c]) {
      btnLastRaw[c]      = raw;
      btnLastChangeMs[c] = now;
    }

    if ((now - btnLastChangeMs[c]) < BTN_DEBOUNCE_MS) continue;
    if (raw == btnStable[c]) continue;

    bool prev    = btnStable[c];
    btnStable[c] = raw;

    // FALLING edge: HIGH->LOW = tombol ditekan
    if (prev == HIGH && raw == LOW) {
      doStopChannel(c);
    }
  }
}

// ===========================================================
//        BACKEND / PAYMENT PROTOCOL (Phase 2) — IMPLEMENTASI
//
//  Transport: Serial (UART0/USB). Gateway website payment menulis perintah
//  berprefix '$' (diakhiri '\n'); firmware membalas/emit berprefix '#'.
//
//  PERINTAH MASUK (dari backend):
//    $PING                                  -> #PONG
//    $STATUS                                -> #STATE {json semua channel}
//    $AUTH,<ch>,<sid>,<ltype>,<lval>        -> otorisasi sesi berbayar
//          ltype: 0=none 1=kWh 2=Rupiah 3=detik ; lval sesuai ltype
//    $DEAUTH,<ch>                           -> batalkan otorisasi
//    $SELECT,<ch>,<m>                       -> pilih profil motor (0..9)
//    $START,<ch>                            -> mulai charging
//    $STOP,<ch>                             -> pause/stop
//    $CLEAR,<ch>                            -> clear fault + wipe sesi
//    $SLEEP / $WAKE                         -> panel modul sleep/wake
//
//  EVENT KELUAR (ke backend), satu baris JSON:
//    #EVT {"ev":"session_start"|"session_stop"|"session_complete"|
//          "cable_unplug"|"fault"|"cleared", "ch":n, "sid":"..","kwh":..,
//          "rp":..,"sec":..}
//    #STATE {"t":ms,"ch":[ {channel..}, .. ]}   (telemetri periodik)
// ===========================================================
static String   beLineBuf;
static uint32_t beLastTelemetry = 0;

// Salin string ke buffer hanya untuk karakter aman (alfanumerik, '_', '-'),
// supaya tidak merusak JSON dan tidak overflow. Selalu NUL-terminated.
static void beCopySanitized(char* dst, size_t dstSz, const String& src) {
  size_t j = 0;
  for (int i = 0; i < src.length() && j < dstSz - 1; i++) {
    char ch = src[i];
    bool ok = (ch >= '0' && ch <= '9') || (ch >= 'A' && ch <= 'Z') ||
              (ch >= 'a' && ch <= 'z') || ch == '_' || ch == '-';
    if (ok) dst[j++] = ch;
  }
  dst[j] = '\0';
}

void backendEmitSession(uint8_t c, const char* event) {
  if (!ENABLE_BACKEND || c >= 3) return;
  float kwh = chEnabled(c) ? sessionKWh(c) : 0.0f;
  uint32_t rp = (uint32_t)lroundf(kwh * PRICE_PER_KWH);
  char cb[200];
  snprintf(cb, sizeof(cb),
    "#EVT {\"ev\":\"%s\",\"ch\":%u,\"sid\":\"%s\",\"kwh\":%.3f,\"rp\":%lu,\"sec\":%lu,\"st\":%u}",
    event, (unsigned)(c + 1), ch[c].sessionId, kwh, (unsigned long)rp,
    (unsigned long)tmrSec(c), (unsigned)ch[c].state);
  Serial.println(cb);
}

void backendEmitFault(uint8_t c, const char* reason) {
  if (!ENABLE_BACKEND || c >= 3) return;
  char cb[160];
  snprintf(cb, sizeof(cb),
    "#EVT {\"ev\":\"fault\",\"ch\":%u,\"reason\":\"%s\",\"pr\":%u,\"sid\":\"%s\"}",
    (unsigned)(c + 1), reason, (unsigned)ch[c].r.protect, ch[c].sessionId);
  Serial.println(cb);
}

static void backendPrintChannelJson(uint8_t c) {
  float kwh = chEnabled(c) ? sessionKWh(c) : 0.0f;
  uint32_t rp = (uint32_t)lroundf(kwh * PRICE_PER_KWH);
  char cb[300];
  snprintf(cb, sizeof(cb),
    "{\"ch\":%u,\"en\":%u,\"st\":%u,\"on\":%u,\"pr\":%u,\"m\":%u,"
    "\"v\":%.2f,\"i\":%.2f,\"p\":%.1f,\"vset\":%.2f,\"iset\":%.2f,"
    "\"kwh\":%.3f,\"rp\":%lu,\"sec\":%lu,\"tin\":%.1f,"
    "\"auth\":%u,\"sid\":\"%s\",\"lt\":%u}",
    (unsigned)(c + 1), chEnabled(c) ? 1 : 0, (unsigned)ch[c].state,
    (unsigned)ch[c].r.onoff, (unsigned)ch[c].r.protect, (unsigned)ch[c].motorIdx,
    ch[c].r.vout, ch[c].r.iout, ch[c].r.power, ch[c].r.vset, ch[c].r.iset,
    kwh, (unsigned long)rp, (unsigned long)tmrSec(c), ch[c].r.t_in,
    ch[c].authorized ? 1 : 0, ch[c].sessionId, (unsigned)ch[c].limitType);
  Serial.print(cb);
}

static void backendPrintTelemetry() {
  if (!ENABLE_BACKEND) return;
  Serial.print("#STATE {\"t\":");
  Serial.print(millis());
  Serial.print(",\"ch\":[");
  for (uint8_t c = 0; c < 3; c++) {
    backendPrintChannelJson(c);
    if (c < 2) Serial.print(',');
  }
  Serial.println("]}");
}

