kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
// Pantau batas sesi berbayar; auto-STOP saat kWh/Rp/durasi tercapai.
// Dipanggil dari updateChannelState() hanya saat state==CHARGING.
void backendCheckSessionLimit(uint8_t c) {
  if (!ENABLE_BACKEND || c >= 3) return;
  if (ch[c].state != CHARGING) return;
  if (ch[c].limitType == 0 || ch[c].limitReached) return;

  bool reached = false;
  switch (ch[c].limitType) {
    // BUGFIX: guard defensif — limit bernilai 0 TIDAK PERNAH dianggap "tercapai"
    // (cegah auto-stop instan bila $AUTH mengirim limit 0/invalid).
    case 1: reached = (ch[c].limitKwh > 0) && (sessionKWh(c) >= ch[c].limitKwh); break; // kWh
    case 2: reached = (ch[c].limitRp  > 0) &&
                      ((uint32_t)lroundf(sessionKWh(c) * PRICE_PER_KWH) >= ch[c].limitRp); break; // Rupiah
    case 3: reached = (ch[c].limitSec > 0) && (tmrSec(c) >= ch[c].limitSec); break;     // detik
    default: break;
  }
  if (!reached) return;

  // Kuota tercapai -> hentikan output, snapshot, lapor backend.
  ch[c].limitReached = true;
  xySetOutput(c, false);
  tmrStop(c);
  ch[c].done_kWh = sessionKWh(c);
  ch[c].done_rp  = (uint32_t)lroundf(ch[c].done_kWh * PRICE_PER_KWH);
  ch[c].done_sec = tmrSec(c);
  ch[c].state    = DONE;
  // BUGFIX (security/billing): kuota habis -> cabut otorisasi (auth sekali pakai).
  ch[c].authorized = false;
  ch[c].limitType  = 0;
  setChanMsg(c, "Kuota tercapai - Sesi selesai", 0x362B, 6000);
  backendEmitSession(c, "session_complete");
}

static void backendHandleLine(const String& ln) {
  if (ln == "$PING")   { Serial.println("#PONG"); return; }
  if (ln == "$STATUS")    { backendPrintTelemetry(); return; }
  if (ln == "$SLEEP")     { handleCmd("SLEEP"); Serial.println("#OK sleep"); return; }
  if (ln == "$WAKE")      { handleCmd("WAKE");  Serial.println("#OK wake");  return; }

  // $SETONLINE / $SETOFFLINE — ubah mode operasi + simpan ke NVS
  if (ln == "$SETONLINE") {
    requireAuth = true;
    saveRequireAuth();
    uiUpdateMode();
    Serial.println("#OK mode=ONLINE");
    return;
  }
  if (ln == "$SETOFFLINE") {
    requireAuth = false;
    saveRequireAuth();
    uiUpdateMode();
    Serial.println("#OK mode=OFFLINE");
    return;
  }
  if (ln == "$GETMODE") {
    Serial.printf("#MODE %s\r\n", requireAuth ? "ONLINE" : "OFFLINE");
    return;
  }

  // $AUTH,<ch>,<sid>,<ltype>,<lval>
  if (ln.startsWith("$AUTH,")) {
    int p1 = ln.indexOf(',', 6);
    int p2 = (p1 >= 0) ? ln.indexOf(',', p1 + 1) : -1;
    int p3 = (p2 >= 0) ? ln.indexOf(',', p2 + 1) : -1;
    if (p1 < 0 || p2 < 0 || p3 < 0) { Serial.println("#ERR auth_format"); return; }

    int chNum  = ln.substring(6, p1).toInt();
    String sid = ln.substring(p1 + 1, p2);
    int ltype  = ln.substring(p2 + 1, p3).toInt();
    float lval = ln.substring(p3 + 1).toFloat();
    if (chNum < 1 || chNum > 3) { Serial.println("#ERR bad_ch"); return; }
    uint8_t c = (uint8_t)(chNum - 1);
    if (!chEnabled(c)) { Serial.println("#ERR ch_disabled"); return; }

    // BUGFIX billing: validasi ltype & lval. Tanpa ini, ltype di luar 1..3 (yang
    // sebelumnya di-constrain) atau lval<=0 menghasilkan limitType!=0 dengan nilai
    // limit 0 -> backendCheckSessionLimit menganggap kuota "tercapai" pada poll
    // pertama dan sesi berbayar langsung selesai 0 kWh.
    if (ltype < 0 || ltype > 3)   { Serial.println("#ERR bad_ltype"); return; }
    if (ltype >= 1 && lval <= 0)  { Serial.println("#ERR bad_limit"); return; }

    beCopySanitized(ch[c].sessionId, sizeof(ch[c].sessionId), sid);
    ch[c].limitType = (uint8_t)ltype;
    ch[c].limitKwh = 0.0f; ch[c].limitRp = 0; ch[c].limitSec = 0;
    if      (ltype == 1) ch[c].limitKwh = lval;
    else if (ltype == 2) ch[c].limitRp  = (uint32_t)lval;
    else if (ltype == 3) ch[c].limitSec = (uint32_t)lval;
    ch[c].authorized   = true;
    ch[c].limitReached = false;

    char cb[80];
    snprintf(cb, sizeof(cb), "#OK auth ch%d sid=%s lt=%d", chNum, ch[c].sessionId, ltype);
    Serial.println(cb);
    return;
  }

  // $DEAUTH,<ch>
  if (ln.startsWith("$DEAUTH,")) {
    uint8_t c;
    if (!parseChannel(ln, 8, c)) { Serial.println("#ERR bad_ch"); return; }
    if (!chEnabled(c)) { Serial.println("#ERR ch_disabled"); return; }
    ch[c].authorized = false;
    ch[c].sessionId[0] = '\0';
    ch[c].limitType = 0; ch[c].limitReached = false;
    Serial.println("#OK deauth");
    return;
  }

  // $SELECT,<ch>,<m>
  if (ln.startsWith("$SELECT,")) {
    int p1 = ln.indexOf(',', 8);
    if (p1 < 0) { Serial.println("#ERR sel_format"); return; }
    int chNum = ln.substring(8, p1).toInt();
    int mIdx  = ln.substring(p1 + 1).toInt();
    if (chNum < 1 || chNum > 3 || mIdx < 0 || mIdx > 9) { Serial.println("#ERR sel_arg"); return; }
    handleCmd("SEL," + String(chNum) + "," + String(mIdx));
    Serial.println("#OK select");
    return;
  }

  // $START,<ch>
  if (ln.startsWith("$START,")) {
    uint8_t c;
    if (!parseChannel(ln, 7, c)) { Serial.println("#ERR bad_ch"); return; }
    if (!chEnabled(c)) { Serial.println("#ERR ch_disabled"); return; }
    if (requireAuth && !ch[c].authorized) { Serial.println("#ERR not_authorized"); return; }
    handleCmd("START," + String(c + 1));   // session_start di-emit di dalam handler bila sukses
    Serial.println(ch[c].state == CHARGING ? "#OK start" : "#ERR start_failed");
    return;
  }

  // $STOP,<ch>
  if (ln.startsWith("$STOP,")) {
    uint8_t c;
    if (!parseChannel(ln, 6, c)) { Serial.println("#ERR bad_ch"); return; }
    if (!chEnabled(c)) { Serial.println("#ERR ch_disabled"); return; }
    handleCmd("STOP," + String(c + 1));
    Serial.println("#OK stop");
    return;
  }

  // $CLEAR,<ch>
  if (ln.startsWith("$CLEAR,")) {
    uint8_t c;
    if (!parseChannel(ln, 7, c)) { Serial.println("#ERR bad_ch"); return; }
    handleCmd("CLEAR," + String(c + 1));
    Serial.println("#OK clear");
    return;
  }

  Serial.println("#ERR unknown_cmd");
}

// Simpan mode ONLINE/OFFLINE ke NVS
static void saveRequireAuth() {
  prefs.putBool("req_auth", requireAuth);
}

// Terapkan mode ke display HMI — dipanggil saat mode berubah atau page load
void uiUpdateMode() {
  if (requireAuth) {
    nxSendCmd("t_htar.txt=\"MODE: PAYMENT (ONLINE)\"");
    // Sync variabel va_mode di semua setting page agar tombol b_mode tahu state saat ini
    nxSendCmd("setting_CH1.va_mode.val=1");
    nxSendCmd("setting_CH2.va_mode.val=1");
    nxSendCmd("setting_CH3.va_mode.val=1");
  } else {
    nxSendCmd("t_htar.txt=\"MODE: FREE (OFFLINE)\"");
    nxSendCmd("setting_CH1.va_mode.val=0");
    nxSendCmd("setting_CH2.va_mode.val=0");
    nxSendCmd("setting_CH3.va_mode.val=0");
  }
}

void backendInit() {
  if (!ENABLE_BACKEND) return;
  beLineBuf.reserve(96);
  requireAuth = prefs.getBool("req_auth", false); // default OFFLINE
  Serial.println("#BOOT SPKLU XY12550S backend ready");
  Serial.printf("#INFO mode=%s\r\n", requireAuth ? "ONLINE" : "OFFLINE");
}

void backendPoll() {
  if (!ENABLE_BACKEND) return;

  // 1) Baca perintah masuk dari UART0 (non-blocking).
  while (Serial.available()) {
    char c = (char)Serial.read();
    if (c == '\n') {
      String ln = beLineBuf; beLineBuf = "";
      ln.trim();
      if (ln.length()) backendHandleLine(ln);
    } else if (c == '\r') {
      // abaikan CR
    } else {
      beLineBuf += c;
      if (beLineBuf.length() > 180) beLineBuf = "";  // anti-overflow
    }
  }

  // 2) Telemetri periodik ke backend.
  if (millis() - beLastTelemetry >= BACKEND_TELEMETRY_MS) {
    beLastTelemetry = millis();
    backendPrintTelemetry();
  }
}

