kurniawan1008/CMW-Charger/SPKLU_Esp32_Rev8.2.ino
// ===========================================================
//                          SETUP / LOOP
// ===========================================================
uint32_t lastPoll=0, lastUi=0;
uint8_t pollIdx=0;

static uint8_t firstEnabledChannel() {
  for(uint8_t c=0;c<3;c++) if(chEnabled(c)) return c;
  return 0;
}

void setup() {
  Serial.begin(115200);

  // Pushbutton emergency stop
  for (uint8_t c = 0; c < 3; c++) {
    if (BTN_PIN[c] >= 0) {
      pinMode(BTN_PIN[c], INPUT_PULLUP);
      btnLastRaw[c] = (bool)digitalRead(BTN_PIN[c]);
      btnStable[c]  = btnLastRaw[c];
    }
  }

  // Phase 3 hardening: pin watchdog eksternal
  if (EXT_WDT_PIN >= 0) pinMode(EXT_WDT_PIN, OUTPUT);

  //pinMode(RS485_DE_RE, OUTPUT);
  //rs485TxOff();

  SerialModbus.begin(MODBUS_BAUD, SERIAL_8N1, UART_MODBUS_RX, UART_MODBUS_TX);
  SerialModbus.setTimeout(200);  // reduce blocking time for ModbusMaster readBytes
  SerialNextion.begin(NEXTION_BAUD, SERIAL_8N1, UART_NEXTION_RX, UART_NEXTION_TX);

  for(int i=0;i<3;i++){
    if(!chEnabled(i)) continue;
    nodes[i].begin(SLAVE_ID[i], SerialModbus);
    // nodes[i].preTransmission(preTransmission);
    // nodes[i].postTransmission(postTransmission);
  }

  //prefs.clear(); // <-- UNCOMMENT sekali saja untuk reset semua profile ke default

  loadProfilesFromNVSOrDefault();
  loadPanelPin(); // S1 FIX: sebelumnya tidak dipanggil, PIN selalu default "1234"

  // Phase 3 hardening: catat alasan reset terakhir + hitung reset tak terduga
  // (WDT/panic/brownout) ke NVS untuk diagnosa lapangan. prefs sudah terbuka.
  {
    esp_reset_reason_t rr = esp_reset_reason();
    Serial.printf("#INFO reset_reason=%d\r\n", (int)rr);
    if (rr == ESP_RST_TASK_WDT || rr == ESP_RST_INT_WDT || rr == ESP_RST_WDT ||
        rr == ESP_RST_PANIC    || rr == ESP_RST_BROWNOUT) {
      uint32_t n = prefs.getUInt("rst_unexp", 0) + 1;
      prefs.putUInt("rst_unexp", n);
      Serial.printf("#WARN reset tak terduga, total=%u\r\n", (unsigned)n);
    }
  }

  // Nextion init
  nxSendCmd("bkcmd=0");                 // production mode: no ack/error spam
  nxSendCmd("page page_welcome");
  nxSendCmd("t_htit.txt=\"SPKLU DC CHARGER\"");
  nxSendCmd("t_htar.txt=\"Tarif: Rp 2440/kWh\"");
  nxSendCmd("t_hcon.txt=\"ONLINE\"");
  nxSendCmd("t_hcon.pco=0x362B");

  // Init each channel
  /*for(int c=0;c<3;c++){
    if(!chEnabled(c)){
      ch[c].state = IDLE;
      ch[c].modbusFailCount = 0;
      continue;
    }

    xySetOutput(c, false);

    if (xyReadBlock(c)) {
      ch[c].modbusFailCount = 0;
      ch[c].state = IDLE;
      resetSession(c);

      // optional: sync profile -> module at boot
      // pushSelectedProfileToModule(c);

    } else {
      ch[c].modbusFailCount = MODBUS_FAIL_LIMIT;
      ch[c].state = FAULT;
    }
  }*/
for(int c=0;c<3;c++){
  if(!chEnabled(c)) continue;
    // 1. Paksa enable + OFF (deterministik)
  xyEnableStage(c);

  // 2. Double safety
  xySetOutput(c, false);
  delay(20);
  // 3. Baru baca status
  if (xyReadBlock(c)) {
    ch[c].modbusFailCount = 0;
    ch[c].state = IDLE;
    resetSession(c);
  } else {
    ch[c].modbusFailCount = MODBUS_FAIL_LIMIT;
    ch[c].state = FAULT;
  }
}

  pollIdx = firstEnabledChannel();

  uiEnterPage(activePage);

  // Backend / payment (Phase 2): siapkan parser + telemetri di UART0.
  // requireAuth dimuat dari NVS di dalam backendInit().
  backendInit();
  uiUpdateMode(); // tampilkan mode OFFLINE/ONLINE di HMI segera setelah boot

  // Hardware watchdog dipasang TERAKHIR, setelah semua init blocking selesai,
  // supaya proses boot yang lambat tidak memicu reboot. Selanjutnya di-feed
  // dari loop(). Version-guard untuk Arduino-ESP32 2.x dan 3.x.
  if (ENABLE_TASK_WDT) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t wdtCfg = {
      .timeout_ms = WDT_TIMEOUT_S * 1000,
      .idle_core_mask = 0,
      .trigger_panic = true
    };
    if (esp_task_wdt_init(&wdtCfg) == ESP_ERR_INVALID_STATE) {
      esp_task_wdt_reconfigure(&wdtCfg);   // TWDT sudah aktif -> cukup set ulang
    }
#else
    esp_task_wdt_init(WDT_TIMEOUT_S, true);
#endif
    esp_task_wdt_add(NULL);                 // pantau loopTask
  }
}

void loop() {
  // 0) Feed hardware watchdog (auto-reboot bila loop macet > WDT_TIMEOUT_S)
  if (ENABLE_TASK_WDT) esp_task_wdt_reset();

  // 0a) Phase 3 hardening: kick watchdog eksternal (sabuk-pengaman) bila dipasang.
  if (EXT_WDT_PIN >= 0) digitalWrite(EXT_WDT_PIN, !digitalRead(EXT_WDT_PIN));

  // 0b) Pushbutton emergency stop
  pollButtons();

  // 1) Nextion input
  String line;
  while (nx.hasLine(line)) {
    handleCmd(line);
  }

  // 1b) Backend / payment (Phase 2): perintah & telemetri di UART0
  backendPoll();

  // 2) Page change refresh
  // W4 FIX: baca activePage via getActivePage() untuk dokumentasi intent atomic
  static uint8_t lastPage = 255;
  uint8_t curPage = getActivePage();
  if (curPage != lastPage) {
    lastPage = curPage;
    uiEnterPage(curPage);
  }

  // 3) Modbus polling
  if (millis() - lastPoll >= POLL_INTERVAL_MS) {
    lastPoll = millis();

    // find next enabled channel without breaking loop()
    uint8_t tries = 0;
    while (tries < 3 && !chEnabled(pollIdx)) {
      pollIdx = (pollIdx + 1) % 3;
      tries++;
    }

    if (tries < 3 && chEnabled(pollIdx)) {
      bool ok = xyReadBlockRetry(pollIdx, MODBUS_READ_ATTEMPTS);
      if (ok) ch[pollIdx].modbusFailCount = 0;
      else if (ch[pollIdx].modbusFailCount < 255) ch[pollIdx].modbusFailCount++;

      // BUGFIX billing: akumulasi energi sesi tiap pembacaan sukses (tahan reset modul)
      if (ok) sessionAccumulate(pollIdx);

      updateChannelState(pollIdx);

      // Phase 1: OCP auto-recovery handler
      handleOCPRetry(pollIdx);

      // Phase 3 hardening: alarm suhu dini
      checkOverTemp(pollIdx);

      pollIdx = (pollIdx + 1) % 3;
    }
  }

  // 4) UI update
  if (millis() - lastUi >= UI_INTERVAL_MS) {
    lastUi = millis();

    bool anyOffline = false;
    bool anyEnabled = false;
    for(int c=0;c<3;c++){
      if(!chEnabled(c)) continue;
      anyEnabled = true;
      if(ch[c].modbusFailCount >= MODBUS_FAIL_LIMIT) anyOffline = true;
    }

    if (!anyEnabled || anyOffline) {
      nxSendCmd("t_hcon.txt=\"OFFLINE\"");
      nxSendCmd("t_hcon.pco=0xF9C6");
    } else {
      nxSendCmd("t_hcon.txt=\"ONLINE\"");
      nxSendCmd("t_hcon.pco=0x362B");
    }

    if (activePage == 0) uiUpdateMonitor();
    else if (activePage >= 1 && activePage <= 3) uiUpdateChannel(getActivePage() - 1);
  }
}
